Revit 2024 API
Transform2D.Assign Method
 Assigns values from the input transformation to this transformation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public void Assign(
	Transform2D from
)
Visual Basic
Public Sub Assign ( _
	from As Transform2D _
)
Visual C++
public:
void Assign(
	Transform2D^ from
)
Parameters
from
Type: Autodesk.Revit.DB.Transform2D
 The transformation to use as input.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
Transform2D Class
Autodesk.Revit.DB Namespace